# 1077. Project Employees III
[問題](https://leetcode.com/problems/project-employees-iii/description/?envType=study-plan-v2&envId=premium-sql-50)

## 解答の方針
mergeして、experience_years.max()のレコードを取り出す。

In [1]:
import pandas as pd

In [2]:
data = [[1, 1], [1, 2], [1, 3], [2, 1], [2, 4]]
project = pd.DataFrame(data, columns=['project_id', 'employee_id']).astype({'project_id':'Int64', 'employee_id':'Int64'})
data = [[1, 'Khaled', 3], [2, 'Ali', 2], [3, 'John', 3], [4, 'Doe', 2]]
employee = pd.DataFrame(data, columns=['employee_id', 'name', 'experience_years']).astype({'employee_id':'Int64', 'name':'object', 'experience_years':'Int64'})

In [3]:
project

   project_id  employee_id
0           1            1
1           1            2
2           1            3
3           2            1
4           2            4

In [4]:
employee

   employee_id    name  experience_years
0            1  Khaled                 3
1            2     Ali                 2
2            3    John                 3
3            4     Doe                 2

In [49]:
def project_employees(project: pd.DataFrame, employee: pd.DataFrame) -> pd.DataFrame:
    merged = project.merge(employee, on="employee_id", how="inner")
    grouped = merged.groupby("project_id").apply(lambda x: x[x.experience_years==x.experience_years.max()])
    result = grouped.reset_index(drop=True)
    return result[["project_id", "employee_id"]]

In [50]:
project_employees(project, employee)

C:\Users\takuya kinoshita\AppData\Local\Temp\ipykernel_22344\4107614082.py:3: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  grouped = merged.groupby("project_id").apply(lambda x: x[x.experience_years==x.experience_years.max()])

   project_id  employee_id
0           1            1
1           1            3
2           2            1

## Test scripts

In [17]:
merged = project.merge(employee, on="employee_id", how="inner")

In [22]:
merged

   project_id  employee_id    name  experience_years
0           1            1  Khaled                 3
1           1            2     Ali                 2
2           1            3    John                 3
3           2            1  Khaled                 3
4           2            4     Doe                 2

In [31]:
grouped = merged.groupby("project_id").apply(lambda x: x[x.experience_years == x.experience_years.max()])

C:\Users\takuya kinoshita\AppData\Local\Temp\ipykernel_22344\2624789205.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  grouped = merged.groupby("project_id").apply(lambda x: x[x.experience_years == x.experience_years.max()])

In [48]:
grouped.reset_index(drop=True)[["project_id", "employee_id"]]

   project_id  employee_id
0           1            1
1           1            3
2           2            1